jiang-source-tech/museum-firmwire/sdkconfig.defaults
# AI Pet S3 sdkconfig 默认配置
# 基于小智架构，针对 ESP32-S3-DevKitC-1 N16R8 硬件

# ── 编译目标 ─────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── Board 选择 ────────────────────────────────────────────────
CONFIG_BOARD_TYPE_AI_PET_S3=y

# ── 语言 ──────────────────────────────────────────────────────
CONFIG_LANGUAGE_ZH_CN=y

# ── 音频处理 (AFE + 降噪, 需要 PSRAM) ────────────────────────
CONFIG_USE_AUDIO_PROCESSOR=y
CONFIG_USE_DEVICE_AEC=n
CONFIG_USE_SERVER_AEC=n

# ── 唤醒词 (AFE WakeNet "你好小芯", 需要 PSRAM) ──────────────
CONFIG_USE_AFE_WAKE_WORD=y
# CONFIG_USE_CUSTOM_WAKE_WORD is not set
CONFIG_SEND_WAKE_WORD_DATA=y
CONFIG_SR_WN_WN9_NIHAOXIAOXIN_TTS=y
CONFIG_SR_MN_CN_NONE=y

# ── PSRAM 配置 ────────────────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# 小于 512 字节的分配才在内部 RAM，否则用 PSRAM（与小智对齐）
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512

# ── Flash 配置 ────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ── WiFi 配网方式 ─────────────────────────────────────────────
CONFIG_USE_HOTSPOT_WIFI_PROVISIONING=y
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# ── 显示风格 ──────────────────────────────────────────────────
CONFIG_USE_DEFAULT_MESSAGE_STYLE=y

# ── Assets ────────────────────────────────────────────────────
CONFIG_FLASH_DEFAULT_ASSETS=y

# ── OTA URL（开发环境占位；生产必须配置 HTTPS 域名）──────────
# 非 HTTPS URL 默认会被固件拒绝；仅受控开发网络可显式启用 HTTP。
CONFIG_OTA_URL="http://124.221.253.206:8003/xiaoxin/ota/"
CONFIG_OTA_PERIODIC_CHECK_INTERVAL_SECONDS=21600
CONFIG_OTA_PERIODIC_CHECK_JITTER_SECONDS=900
CONFIG_OTA_RELEASE_CHANNEL="stable"
CONFIG_OTA_MIN_BATTERY_PERCENT=40
# Development bootstrap only: production release configuration must override
# CONFIG_OTA_URL with HTTPS and leave this option disabled.
CONFIG_OTA_ALLOW_INSECURE_HTTP=y
# CONFIG_OTA_ALLOW_LEGACY_UNSIGNED_OFFERS is not set

# ── FreeRTOS ──────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000

# ── Log 级别 ─────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ── 从小智 sdkconfig.defaults 合并 ──
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=1024
CONFIG_COMPILER_CXX_RTTI=y

CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=2048

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/xiaoxin-ota-16m.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=n
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y

# These entries are copied from ESP-HI (ESP32C3) to reduce memory usage
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_NEWLIB_NANO_FORMAT=y
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n

CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

# Fix ML307 FIFO Overflow
CONFIG_UART_ISR_IN_IRAM=y

# VSCode ESP-IDF monitor connects to the board through USB Serial/JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Fix ESP_SSL error
CONFIG_MBEDTLS_SSL_RENEGOTIATION=n

# LVGL 9.2.2

CONFIG_LV_OS_NONE=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_USE_ASSERT_STYLE=y

# Use compressed font
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=n
CONFIG_LV_USE_FONT_PLACEHOLDER=n
CONFIG_LV_USE_LODEPNG=y

# Disable extra widgets to save flash size
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_CALENDAR_HEADER_ARROW=n
CONFIG_LV_USE_CALENDAR_HEADER_DROPDOWN=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_KEYBOARD=n
CONFIG_LV_USE_LED=n
CONFIG_LV_USE_LIST=n
CONFIG_LV_USE_MENU=n
CONFIG_LV_USE_MSGBOX=n
CONFIG_LV_USE_SPAN=n
CONFIG_LV_USE_SPINBOX=n
CONFIG_LV_USE_SPINNER=n
CONFIG_LV_USE_TABVIEW=n
CONFIG_LV_USE_TILEVIEW=n
CONFIG_LV_USE_WIN=n

CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

